#1、进入库 xz
USE xz;
#2、创建表 xz_news
#技巧1:库名；表名；列表；全英文小写字母
create table xz_news(
    id int primary key auto_increment,#id号
    title varchar(50),#新闻标题
    ctime datetime,#新闻时间
    point int,#点击率
    img_url varchar(255),#图片路径
    content varchar(255)#新闻内容
);
#货币 小数计算误差
#价格 购物车合计
#double decimal(10,2)
#严格 将货币转换 分单位 1.99->199
#显示 1.99 
#3、添加20条记录
insert into xz_news values
    (1,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/1.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；发现离不开你，我开始决定回去，你已不在原地；我可以接受你的所有，所有小脾气，我可以带你去吃很多，很多好东西，我可以偶尔给你带来，带来小甜蜜，就像前几年那样每天都会给你制造很多惊喜"),
    (2,"《后来 》-刘若英",now(),0,"http://127.0.0.1:3000/img/2.jpg","你都如何回忆我，带着笑或是很沉默，这些年来，有没有人能让你不寂寞"),
    (3,"《消愁》-毛不易",now(),0,"http://127.0.0.1:3000/img/3.jpg","虽然从不相信所谓是山高水长，人生苦短何必念念不忘；"),
    (4,"《说谎》-林宥嘉",now(),0,"http://127.0.0.1:3000/img/4.jpg","我没有说谎，我何必说谎，你懂我的，我对你从来就不会假装"),
    (5,"《盗将行》-花粥",now(),0,"http://127.0.0.1:3000/img/5.jpg","枕风宿雪多年，我与虎谋早餐，拎着钓叟的鱼弦，问卧龙几两钱"),
    (6,"《请先说你好》-贺一航",now(),0,"http://127.0.0.1:3000/img/6.jpg","以后再遇见你，在遇见你，请你先说你好，我怕控制不住就会给你拥抱"),
    (7,"《遇见》-孙燕姿",now(),0,"http://127.0.0.1:3000/img/7.jpg","我遇见谁会有怎样的对白，我等的人她在多远的未来"),
    (8,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/8.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (9,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/9.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (10,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/10.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (11,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/11.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (12,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/12.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (13,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/13.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (14,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/14.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (15,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/15.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (16,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/16.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (17,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/17.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (18,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/18.jpg","发现离不开你，我开始决定回去，你已不在原地；"),
    (19,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/19.jpg","说好带你流浪，而我却半路返航，坠落自责的海洋；"),
    (20,"《可不可以》-张紫豪",now(),0,"http://127.0.0.1:3000/img/20.jpg","发现离不开你，我开始决定回去，你已不在原地；")
#4、查询

#1、创建评论表
create table xz_comment(
    id int primary key auto_increment,#评论编号
    nid int,#评论所属新闻编号
    user_name varchar(25),#评论人名称
    ctime datetime,#时间
    content varchar(120)#内容
)
#2、添加15条数据
insert into xz_comment values
    (null,1,"鲁迅",now(),"这话我没说过"),
    (null,1,"朱自清",now(),"我去买个橘子，你就在此地不要走动"),
    (null,1,"牛顿",now(),"我的棺材板都盖不住了"),
    (null,1,"王境泽",now(),"真香"),
    (null,1,"孙悟空",now(),"呆~妖怪哪里跑！！！"),
    (null,2,"猪八戒",now(),"我好想回高老庄啊！"),
    (null,2,"沙悟净",now(),"大师兄，师傅被妖怪抓走了！"),
    (null,2,"柯南",now(),"真相只有一个！"),
    (null,2,"灰太狼",now(),"我一定会回来的！"),
    (null,2,"段正淳",now(),"她是你妹妹啊！"),
    (null,3,"张东",now(),"事到如今，有些事你们也该知道了"),
    (null,3,"易松林",now(),"南山南，北海北..."),
    (null,3,"老梅",now(),"我的愿望的是世界和平！！！！"),
    (null,3,"老王",now(),"重庆欢迎您  wel come to chongqing!"),
    (null,3,"老攀",now(),"大吉大利，今晚吃鸡");


#1、创建用户登录表
create table xz_login(
    id int primary key auto_increment,
    uname varchar(25) not null default '', #default 默认值为空，为解决数据库兼容性问题
    upwd varchar(32) not null default '', #md5加密以后会变成32位
    usertype int #用户类型 0普通用户、1管理员、2图书馆馆长
)
#2、添加数据
insert into xz_login values
    (null,"lilei",md5(123456)),
    (null,"tom",md5(123456)),
    (null,"jerry",md5(123456))

#1、创建用户信息表
#2、添加数据